In [1]:
import env
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

from acquire import get_iris_data, get_titanic_data
from prepare import prep_iris, prep_titanic
from pydataset import data
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

****
****
# Part I
#### import data from the pydataset, Excel, and Google Sheets
****

## Problem 1
##### Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
df_iris = data('iris')
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [3]:
df_iris.shape

(150, 5)

In [4]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [5]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Exercise 2. 
##### Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [6]:
df_excel = pd.read_excel("Spreadsheets_Exercises.xlsx", sheet_name='Table1_CustDetails')
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes

In [7]:
df_excel_sample = df_excel.head(100)
df_excel_sample.shape

(100, 12)

In [8]:
df_excel.shape

(7049, 12)

In [9]:
df_excel.iloc[0, :5]

customer_id          0002-ORFBO
gender                   Female
is_senior_citizen             0
partner                     Yes
dependents                  Yes
Name: 0, dtype: object

In [10]:
df_excel.iloc[0][(df_excel.dtypes == 'object') == True]

customer_id       0002-ORFBO
gender                Female
partner                  Yes
dependents               Yes
payment_type    Mailed check
churn                     No
Name: 0, dtype: object

In [11]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 12 columns):
customer_id          7049 non-null object
gender               7049 non-null object
is_senior_citizen    7049 non-null int64
partner              7049 non-null object
dependents           7049 non-null object
phone_service        7049 non-null int64
internet_service     7049 non-null int64
contract_type        7049 non-null int64
payment_type         7049 non-null object
monthly_charges      7049 non-null float64
total_charges        7038 non-null float64
churn                7049 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 661.0+ KB

In [12]:
df_excel.iloc[0][(df_excel.dtypes == 'object') != True]

is_senior_citizen        0
phone_service            1
internet_service         1
contract_type            1
monthly_charges       65.6
total_charges        593.3
Name: 0, dtype: object

## Exercise 3
##### Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [13]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
df_googlesheet.shape

(891, 12)

In [15]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [17]:
df_googlesheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
df = df_googlesheet.select_dtypes(include='object')
column_values = df.values.ravel()
unique_values =  pd.unique(column_values)
unique_values

array(['Braund, Mr. Owen Harris', 'male', 'A/5 21171', ..., 'C148',
       'Dooley, Mr. Patrick', '370376'], dtype=object)

****
# Part II
#### access codeup_db and import SQL data using acquire.py
***

## 1. Create Iris DataFrame

In [19]:
iris_df = get_iris_data()

- CodeUp_db successfully accessed ...
- iris_db SQL query successful ...

In [20]:
iris_df.head(3)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa

In [21]:
iris_train, iris_test, iris_le = prep_iris(iris_df)

iris_train.csv created
iris_test.csv created

/Users/dadsmac/codeup-data-science/ds-methodologies-exercises/classification/prepare.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['species'] = le.fit_transform(train.species)
/Users/dadsmac/codeup-data-science/ds-methodologies-exercises/classification/prepare.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test['species'] = le.transform(test.species)

In [22]:
iris_train.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [23]:
iris_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 5 columns):
sepal_length    112 non-null float64
sepal_width     112 non-null float64
petal_length    112 non-null float64
petal_width     112 non-null float64
species         112 non-null int64
dtypes: float64(4), int64(1)
memory usage: 4.5 KB

## 2. Titanic Data
- Use the function you defined in acquire.py to load the titanic data set.
- Handle the missing values in the embark_town and embarked columns.
- Remove the deck column.
- Use a label encoder to transform the embarked column.
- Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?
- Fill the missing values in age. The way you fill these values is up to you. Consider the tradeoffs of different methods.
- Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [24]:
titanic_df = get_titanic_data()
print('%d rows and %d columns' % titanic_df.shape)
titanic_df.head()

- CodeUp_db successfully accessed ...
- titanic_db SQL query successful ...
891 rows and 13 columns

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [25]:
titanic_train = prep_titanic(titanic_df)
titanic_train

titanic_train.csv created
titanic_test.csv created

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,embark_town,alone
0,329,1,1,female,16.0,0,1,57.9792,C,Cherbourg,0
1,749,0,3,male,31.0,0,0,7.7500,Q,Queenstown,1
2,203,0,3,male,45.5,0,0,7.2250,C,Cherbourg,1
3,421,0,3,male,21.0,0,0,7.7333,Q,Queenstown,1
4,97,1,1,male,23.0,0,1,63.3583,C,Cherbourg,0
...,...,...,...,...,...,...,...,...,...,...,...
707,98,1,2,female,34.0,0,1,23.0000,S,Southampton,0
708,322,1,2,female,30.0,0,0,12.3500,Q,Queenstown,1
709,382,0,3,male,32.0,0,0,7.9250,S,Southampton,1
710,365,0,3,male,30.0,0,0,7.2500,S,Southampton,1
711,510,1,3,male,29.0,0,0,7.7500,Q,Queenstown,1